In [1]:
import pandas as pd 
import numpy as np

# Problem Statement

It happens all the time: someone gives you data containing mlformed strings, Python, lists and missing data. how do you idy it up so you can get on with the analysis?
         
        Take this monstrosity as the DataFrame to use in the following puzzles:

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris','MAdrid_miLAN', 
                               'londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
                   'FlightNumber': [10045,np.nan,10065,np.nan,10085], 
                   'RecentDelays': [[23,47],[],[24,43,87],[13],[67,32]], 
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways.)',
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []   <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]      12. Air France
4   Brussels_londOn       10085.0      [67, 32]         "Swiss Air"

In [3]:
# Make a copy of df in data.
data = df.copy()
data

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []   <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]      12. Air France
4   Brussels_londOn       10085.0      [67, 32]         "Swiss Air"

1. Some values in the Flightnumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place fill in these missing numbers and make column an integer column (instead of a float column).

In [ ]:
for i in range(5):
    data.loc[i , 'FlightNumber'] = 10045 + (i*10)  
data

In [ ]:
data['FlightNumber'] = data['FlightNumber'].astype(int)

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _to give a new temporary DataFrame with the correct values. ASsign the correct column names to this temporary DataFrame.
3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase.(e.g. 'londON' should become "London".)

In [ ]:
list1 = []
list2 = []

for i in data['From_To']:
    k,l = i.split(sep = '_')
    list1.append(k.capitalize())
    list2.append(l.capitalize())

In [ ]:
data['From'] = pd.DataFrame(list1)
data['To'] = pd.DataFrame(list2)

In [ ]:
data

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [ ]:
data.drop('From_To', axis = 1, inplace = True)
data

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

6. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1,delay_2,etc, and replace the unwanted RecentDelays column in df with delays.

In [ ]:
for i in range(3):
    data['delay' + str(i+1)] = data['RecentDelays'].str.get(i)

In [ ]:
data.rename(columns = {'RecentDelays': 'Delays'}, inplace = True)
data